USE[DB_Pharmacy]

INSERT INTO 
[dbo].[PrescriptionDoctor]([NameDoctor],[SurnameDoctor], [SealDoctor],[SignatureDoctor],[NamePatient],[SurnamePatient],[DateBirth],[Diagnosis])
VALUES
('Василь','Жук','0','0','Артем','Гагарін','20020206','Близькорукість'),
('Павло','Козьодуб','0','0','Артем','Гагарін','20020206','Вивих запястя правої руки'),
('Микола','Комаровський','0','0','Іван','Карпов','20000907','Язва'),
('Василь','Жук','0','0','Анатолій','Кортов','19990110','Вроджена дальнорукість'),
('Сергій','Коваль','0','0','Ігор','Стопов','19990110','Коклюш'),
('Сергій','Коваль','0','0','Ігор','Харламов','19920110','Бронхіт');

INSERT INTO 
TechnologyPreparation([Ingredients],[Recipe],[ExpirationDate])
VALUES
('аа','аа','5 day'),
('ии','ии','10 day'),
('мм','мм','10 day'),
('уу','уу','1 mounth'),
('уу','уу','1 year');


INSERT INTO 
PharmacyDrug([NameDrug],[Count],[Prise],[CriticalNorm], [IdTechnology])
VALUES
('Офтаміл50','50','220.00','5','1'),
('Левагель','50','17.75','10','2'),
('Синосил','20','50.50','5','3'),
('Коваміл','35','120.00','10','4'),
('Киротіл','4','500.00','1','5');

INSERT INTO 
FactoryDrugs([NameDrug],[NameCompany],[Count],[Prise],[CriticalNorm])
VALUES
('Атропін','Байер','10','210.00','5'),
('Аспірін','Фармасютік','100','15.75','5'),
('Вугілля','Байер','50','12.00','5'),
('Дуфалак','Файзер','62','57.50','5'),
('Атоксіл','ДжонсонендДжонсон','15','63.00','5');


INSERT INTO 
DirectoryOrder([TypeDrug],[NamePharmacyDrug],[NameFactoryDrug],[Bought])
VALUES
('Factory',NULL,'Атропін','0'),
('Pharmacy','Офтаміл50',NULL,'1'),
('Factory',NULL,'Аспірін','1'),
('Factory',NULL,'Вугілля','0'),
('Pharmacy','Левагель',NULL,'0'),
('Pharmacy','Синосил',NULL,'0'),
('Factory',NULL,'Дуфалак','1'),
('Pharmacy','Синосил',NULL,'1'),
('Factory',NULL,'Атропін','1');

INSERT INTO 
ListDrugs([IdPrescription],[IdOrder])
VALUES
('1','1'),
('2','2'),
('2','3'),
('3','4'),
('3','5'),
('3','6'),
('4','7'),
('5','8'),
('6','9');

INSERT INTO 
[Order]([NameDrug],[Count],[Adress],[DateOrder],[PriseOrder])
VALUES
('Атропін','10','м. Київ вул. Політехнічна буд. 23','20211110','2100.00'),
('Аспірін','100','м. Київ вул. Політехнічна буд. 23','20210711','1575.00'),
('Вугілля','50','м. Київ вул. Янгеля буд. 5','20211102','600.00'),
('Дуфалак','62','м. Київ вул. Янгеля буд. 5','20211102','3565.00'),
('Атоксіл','15','м. Київ вул. Янгеля буд. 10','20211102','945');